.model small

.data
    array dw 8*15 dup(0)
    
    ; коли починається цикл array_cols (всередині циклу array_rows),
    ; лічильник cx, який індикує поточний рядок треба зберегти
    ; щоб використати для циклу array_cols, а по закінченню array_cols, завантажити назад
    row_counter dw 0  

.code
main PROC
    
    ;(1A: 1.5 бали)
    ;Визначити двовимірний масив 8x15. Елемент масиву - теж слово.
    ;Записати значення (2*X+Y) у елементи цього масиву без використання CALL/RET,
    ;де X - рядок, Y - стовпчик.

    ;лічильник циклу, який також слугує як лічільник рядків X (йде від 7 до 0)
    mov cx, 7

    @array_rows:

        ;запам'ятати на якому рядку ми закінчили
        mov row_counter, cx    
        ;встановити лічильник циклу, який також слугує як лічільник стовпців Y(йде від 14 до 0)
        mov cx, 14 

        @array_cols:
            ;обчислити 2*X+Y і зберегти в si
            mov ax, row_counter
            add ax, ax
            add ax, cx
            mov si, ax

            ;знайти індекс комірки та зберегти в di:
            ;зберегти в ax лічильник рядка  
            mov ax, row_counter        
            ;зберегти загальну кількість стовпців
            mov bx, 15 
            ;помножити лічильник рядка на загальну кількість стовпців
            mul bx
            ;додати лічільник стовпців
            add ax, cx
            ;зберегти результат
            mov di, ax

            ;вписати результат в комірку
            mov [array + di], si

            ;повторювати поки лічильник не дійде до 0-го стовпця
            loop @array_cols

        ;повернути запам'ятований лічильник рядків
        mov cx, row_counter
        ;повторювати поки лічильник не дійде до 0-го рядка
        loop @array_rows
main endp
end main